<template>
  <div>
    <WidgetsNavbar
      leftIcon="mdi-chevron-left"
      RouteTo="/Wallet"
      :title="$t('about')"
    />
    <div class="warper" style="background-color: #ffffff">
      <div
        class="header"
        style="display: flex; justify-content: center; margin-top: 60px"
      >
        <h2>เกี่ยวกับ ZFX</h2>
      </div>
      <div class="risk-buyandsell" style="padding: 20px">
        <p>เกี่ยวกับ บริษัท Zeal (ในนาม Zeal Group)</p>
        <p style="margin-top: 10px">
          กลุ่มบริษัท Zeal (ในนาม Zeal Group)
          คือองค์กรที่ประกอบด้วยสถาบันการเงินที่ถูกกฎหมายสากล (ชื่อทางการค้า
          ZFX) และกลุ่มบริษัท FinTech
          ที่เชี่ยวชาญในการจัดการสภาพคล่องของสินทรัพย์ที่หลากหลายในตลาดด้วยเทคโนโลยีที่เป็นกรรมสิทธิ์ที่ปรากฏในตลาดหลักทั่วโลกZeal
          ก่อตั้งขึ้นโดยกลุ่มนักลงทุนผู้ช่ำชองที่มีประสบการณ์ยาวนานหลายทศวรรษในอุตสาหกรรม
          ที่ไม่เพียงแต่แบ่งปันความชื่นชมในความซับซ้อนในโลกของการซื้อขายทางการเงินเท่านั้น
          แต่ยังมีความเชี่ยวชาญและความมุ่งมั่นที่จะสร้างการเปลี่ยนแปลงให้เกิดขึ้น
          Zeal
          มีเหตุผลในการดำรงอยู่ที่หยั่งรากลึกและตั้งเป้าหมายที่จะให้บริการการซื้อขายสินทรัพย์ที่หลากหลายในระดับที่สูงขึ้นให้แก่นักลงทุนรายย่อยและนักลงทุนสถาบัน
        </p>
        <p style="margin-top: 10px">
          ด้วยความผันผวนของความเสี่ยงทางการตลาด ZFX
          จึงมุ่งเน้นไปที่การจัดหาราคาที่ดีที่สุดในตลาดโลก
          โดยใช้เทคโนโลยีที่ทันสมัยและให้บริการการซื้อขายที่ดีที่สุดในระดับเดียวกันเพื่อให้แน่ใจว่าผลลัพธ์ของการซื้อขายทุกครั้งที่ดำเนินการที่
          Zeal นั้นเป็นราคาที่กำหนดโดยตลาดกลางเท่านั้น
          ความโปร่งใสในการกำหนดราคาทำให้มั่นใจได้ว่า Zeal
          ได้รับการยอมรับว่าเป็นตัวแทนนายหน้าหลักในการให้บริการ
        </p>
      </div>
      <div class="risk-CFD" style="padding: 20px">
        <p align-center>ค่านิยมหลักของ ZFX</p>
        <h5>ความปลอดภัยของเงินทุน</h5>
        <p style="margin-top: 10px">
          เงินของลูกค้ารายย่อยจะถูกแยกจากบัญชีบริษัทอย่างชัดเจน
          ดังนั้นเงินทุนในส่วนนี้จะไม่มีการนำมาใช้เพื่อการชำระภาระหนี้ของบริษัทแต่อย่างใด
        </p>
      </div>
      <div class="risk-CFD" style="padding: 20px">
        <p>คำเตือนเกี่ยวกับคำแนะนำทั่วไป</p>
        <p style="margin-top: 10px">
          คำแนะนำทั่วไปที่เราแจ้งคุณหรือคำแนะนำบนเว็บไซต์หรือบนแพลตฟอร์มการซื้อ-ขายไม่ได้พิจารณาสถานะทางการเงิน,
          วัตถุประสงค์หรือความต้องการส่วนตัวของคุณเป็นการเฉพาะ
          การซื้อ-ขายสัญญาซื้อขายส่วนต่าง (CFD) ไม่เหมาะกับลูกค้าทุกท่าน
          เราแนะนำให้คุณฝึกการซื้อ-ขายแบบไม่มีความเสี่ยงบนแพลตฟอร์มตัวอย่างก่อนการลงทุนจริง
          คุณควรพิจารณาวัตถุประสงค์, สถานะทางการเงิน,
          วัตถุประสงค์และความต้องการของคุณ
          และค่อยๆทำความเข้าใจผลการซื้อ-ขายและยุทธศาสตร์ที่สามารถนำมาใช้กับแพลตฟอร์มการซื้อ-ขายจริง
          คุณควรรับคำแนะนำด้านการเงินจากหน่วยงานที่ดำเนินงานอย่างอิสระเพื่อให้แน่ใจว่าผลิตภัณฑ์ทางการเงินนั้นเหมาะกับสถานะทางการเงินและความต้องการของคุณ
        </p>
        <h5 style="margin-top: 10px">การกำกับดูแลกิจการ</h5>
        <p style="margin-top: 10px">
          เรามีการดำเนินการภายในที่มีประสิทธิภาพและระบบบริหารทางการเงินที่เข้มงวด
          เพื่อสร้างการกำกับดูแลกิจการที่ดีเยี่ยม การดำเนินการทั้งหมดของ Zeal
          ถูกควบคุมโดยผู้เชี่ยวชาญทางการเงินและอยู่ภายใต้การตรวจสอบตามกฎหมาย
        </p>
        <h5 style="margin-top: 10px">Market Neutral Agency Model</h5>
        <p style="margin-top: 10px">
          ธุรกิจของเรามุ่งเน้นไปที่การจัดหาราคาที่ดีที่สุดในตลาดโลก
          โดยใช้เทคโนโลยีที่ทันสมัยและให้บริการการซื้อขายที่ดีที่สุดในระดับเดียวกันเพื่อให้แน่ใจว่าผลลัพธ์ของการซื้อขายทุกครั้งที่ดำเนินการกับเรานั้นเป็นราคาที่กำหนดโดยตลาดกลางเท่านั้น
        </p>
        <h5 style="margin-top: 10px">Zeal Capital Market (Seychelles)</h5>
        <h5 style="margin-top: 10px">
          หมายเลขใบอนุญาต FSA ของ Zeal Capital Market (Seychelles) Limited คือ
          SD027
        </h5>

        <p style="margin-top: 10px">
          Seychelles Financial Services Authority (FSA)
          เป็นหน่วยงานกำกับดูแลในกำกับของรัฐที่รับผิดชอบภาคบริการทางสถาบันทางการเงินที่ไม่ใช่ธนาคารในเซเชลส์
          FSA ก่อตั้งขึ้นภายใต้พระราชบัญญัติ Financial Services Authority ปี
          2013 มีหน้าที่รับผิดชอบในการออกใบอนุญาตและควบคุมใบอนุญาต
          บังคับใช้ข้อกำหนดด้านกฎระเบียบและการปฏิบัติตามข้อกำหนดการตรวจสอบและกำกับดูแลการดำเนินธุรกิจในภาคบริการทางสถาบันทางการเงินที่ไม่ใช่ธนาคารในเซเชลส์
          กิจกรรมที่ได้รับการควบคุม ได้แก่
          การบริการด้านความไว้วางใจในตลาดทุนและแผนการลงทุน ธุรกิจประกันภัย
          ธุรกิจการพนัน FSA ยังรับผิดชอบในการจดทะเบียนบริษัทให้แก่
          ธุรกิจระหว่างประเทศ มูลนิธิ ห้างหุ้นส่วนจำกัด
          และการบริการด้านความไว้วางใจระหว่างประเทศในเซเชลส์
          สามารถศึกษาข้อมูลเพิ่มเติมเกี่ยวกับข้อมูลทางกฎหมายของ FSA
          ได้ที่เว็บไซต์ https://www.fsaseychelles.sc/
        </p>

        <h5 style="margin-top: 10px">Zeal Capital Markets Limited (UK)</h5>
        <h5 style="margin-top: 10px">
          หมายเลขใบอนุญาต FCA ของ Zeal Capital Market (UK) Limited คือ FCA (FRN)
          : 768451
        </h5>

        <p style="margin-top: 10px">
          Financial Conduct Authority (FCA)
          เป็นหน่วยงานกำกับดูแลทางการเงินในสหราชอาณาจักร
          แต่ดำเนินการโดยไม่ขึ้นกับรัฐบาลสหราชอาณาจักรและได้รับการสนับสนุนทางการเงินจากการเรียกเก็บค่าธรรมเนียมจากสมาชิกในอุตสาหกรรมบริการทางการเงิน
          เมื่อวันที่ 19 ธันวาคม 2012 พระราชบัญญัติการให้บริการทางการเงิน พ.ศ.
          2012 ได้รับความยินยอมและมีผลบังคับใช้ในวันที่ 1 เมษายน 2013
          พระราชบัญญัติดังกล่าวได้สร้างกรอบการกำกับดูแลบริการทางการเงินใหม่และยกเลิกหน่วยงานบริการทางการเงินเดิม
          FCA
          ควบคุมกำกับดูแลบริษัทที่ให้บริการทางด้านการเงินทั้งสำหรับรายย่อยและรายใหญ่ในสหราชอาณาจักร
          ทำให้ตลาดการเงินดำเนินไปด้วยดี เพื่อปกป้องผู้บริโภค
          เพิ่มความมั่นคงของตลาด
          สามารถศึกษาข้อมูลเพิ่มเติมเกี่ยวกับข้อมูลทางกฎหมายของ FCA
          ได้ที่เว็บไซต์ https://www.fca.org.uk/
        </p>

        <p style="margin-top: 20px">
          หมายเหตุ : หากเอกสารฉบับนี้มีการตีความเป็นภาษาอื่น
          หรือเกิดข้อพิพาทในการตีความหมาย
          ให้อิงฉบับภาษาอังกฤษมาใช้ในการตีความและตัดสินเป็นหลัก
        </p>
      </div>
    </div>
  </div>
</template>
<script>
import { mapActions } from "vuex";

export default {
  data() {
    return {
      selectedItem: 0,
    };
  },
  methods: {
    ...mapActions("authen", ["logout"]),
    changeLang(lang) {
      this.$i18n.locale = lang;
      this.$cookies.set("lang", lang);
    },
    onLogout() {
      this.logout();
      this.$router.push("/");
    },
  },
};
</script>
