<template>
  <div>
    <WidgetsNavbar
      leftIcon="mdi-chevron-left"
      RouteTo="/Wallet"
      :title="$t('helpCenter')"
    />
    <div class="warper" style="background-color: #ffffff; margin-top: 60px">
      <v-expansion-panels>
        <v-expansion-panel>
          <v-expansion-panel-header>
            รองรับวิธีการชำระเงินแบบใดบ้าง?
          </v-expansion-panel-header>
          <v-expansion-panel-content>
            เรารองรับวิธีการชำระเงินหลายวิธีในการฝากหรือถอนเงินเข้าหรือออกจากบัญชีเทรดของคุณ
            แม้ว่าเราจะสนับสนุนวิธีต่างๆ มากมาย
            แต่คุณควรจำไว้ว่าตัวเลือกบางตัวอาจไม่สามารถใช้ได้ในทุกที่ที่ลูกค้าของเราใช้
            เพื่อดูว่ามีตัวเลือกใดบ้าง คุณ เข้าสู่ระบบบัญชี MyZFX
            เพื่อดูตัวเลือกการฝากเงิน ก่อนทำการฝากเงิน
            คุณควรทำความคุ้นเคยกับวิธีการถอนเงินก่อนเบื้องต้น
          </v-expansion-panel-content>
        </v-expansion-panel>
        <!-- vers2 -->
        <v-expansion-panel>
          <v-expansion-panel-header> วิธีการถอนเงิน? </v-expansion-panel-header>
          <v-expansion-panel-content>
            คุณสามารถถอนเงินจากบัญชีของคุณ
            โดยไปยังวิธีการชำระเงินเดิมที่ใช้ในการฝากเงิน
            จำนวนเงินที่คุณสามารถถอนไปยังวิธีการชำระเงินเดิมจะต้องไม่เกินจำนวนเงินที่คุณฝาก
            สมมติว่าคุณทำกำไรจากการเทรด
            คุณต้องถอนเงินส่วนเกินเข้าบัญชีธนาคารของคุณ
            เพื่อให้แน่ใจว่าคุณสามารถถอนกำไรของคุณได้
            โปรดตรวจสอบให้แน่ใจว่าตัวตนและบัญชีธนาคารของคุณได้รับการยืนยันอย่างถูกต้อง
          </v-expansion-panel-content>
        </v-expansion-panel>

        <!-- vers2 -->
        <v-expansion-panel>
          <v-expansion-panel-header>
            โปรแกรมแนะนำ (Referral) ทำงานอย่างไร??
          </v-expansion-panel-header>
          <v-expansion-panel-content>
            ที่ ZFX
            เรามีโอกาสเป็นพันธมิตรทางธุรกิจที่น่าตื่นเต้นสำหรับคู่ค้าทางธุรกิจและลูกค้าของเรา
            โดยส่วนใหญ่จะทราบว่าโบรกเกอร์ Forex ส่วนใหญ่จะมีระบบโปรแกรม Referral
            ซึ่งรวมถึง ZFX
            แต่นักเทรดส่วนใหญ่มักไม่ทราบว่าการเทรดนั้นไม่ใช่วิธีเดียวที่จะทำกำไรจากตลาด
            forex หากคุณอยู่ในชุมชนหรือมีครอบครัว เพื่อนฝูง
            หรือเพื่อนร่วมงานที่สนใจเทรด Forex หรือการเก็งกำไรในหุ้นและดัชนี
            คุณสามารถเป็นพันธมิตรกับ ZFX ได้ หากคุณแนะนำผู้คนให้ใช้ ZFX ทาง ZFX
            จะจ่ายให้คุณเป็นเปอร์เซ็นต์ของค่าคอมมิชชั่นการเทรดหรือสเปรดเพื่อเป็นการขอบคุณสำหรับการแนะนำลูกค้าใหม่ให้เรา
            ในฐานะเทรดเดอร์ คุณสามารถรับรายได้สูงถึง 20%
            ของสเปรดหรือค่าคอมมิชชันเมื่อใดก็ตามที่ลูกค้าที่คุณแนะนำ
            ได้ทำการเทรด สะสม 20% ในกลุ่มโบนัส ยิ่งพวกเขาเทรดมากเท่าไหร่
            โบนัสก็จะเพิ่มขึ้นมากเท่านั้น โดยเรทที่จะได้รับหรือในการถอนออกจาก
            Bonus Pool คุณต้องเทรด 1 ล็อตมาตรฐานเพื่อแปลง 10 ดอลลาร์สหรัฐฯ
            เป็นยอดคงเหลือที่สามารถถอนได้ หากคุณสงสัยว่าทำไมเราถึงเสนอ Referral
            โปรแกรม เพราะว่าวิธีนี้เป็นเรื่องง่าย
            กว่าวิธีที่โบรกเกอร์ต้องใช้เงินจำนวนมากในการโฆษณาเพื่อแข่งขันกับหาลูกค้าใหม่
            ซึ่งเราคิดว่าจะดีกว่าที่จะคืนเงินให้กับลูกค้าหากพวกเขาสามารถช่วยเราหาลูกค้าใหม่ได้
            มันเป็นวิธีการที่ win-win เมื่อคุณลงชื่อเข้า MyZFX
            คุณจะพบลิงก์อ้างอิงเฉพาะ คุณสามารถแชร์รหัสอ้างอิง ลิงก์อ้างอิง
            หรือรหัส QR กับคนที่คุณจะแนะนำของคุณได้ และหากพวกเขาลงทะเบียน
            พวกเขาจะถูกระบุแหล่งที่มาจากคุณ ในส่วน “Refer Client” ของ MyZFX
            คุณสามารถดูจำนวนคนที่คุณแนะนำได้ หรือแม้กระทั้ง
            จำนวนล็อตที่พวกเขาเทรด
          </v-expansion-panel-content>
        </v-expansion-panel>
        <!-- vers2 -->
        <v-expansion-panel>
          <v-expansion-panel-header>
            ฉันจะตรวจสอบประวัติการเทรดของฉันได้อย่างไร?
          </v-expansion-panel-header>
          <v-expansion-panel-content>
            เมื่อคุณลงชื่อเข้าใช้โปรไฟล์ MyZFX ให้คลิกที่ตัวเลือก “รายงาน”
            ในเมนู จากนั้นเลือก “ประวัติการเทรด”
            ตอนนี้คุณสามารถดูรายการการเทรดทั้งหมดของคุณในช่วงเวลาที่เลือก
            หากคุณมีบัญชีเทรดมากกว่าหนึ่งบัญชี
            คุณจะเห็นรายการทั้งหมดอยู่ในแถวเหนือการตั้งค่าเวลา
            การดูประวัติการเทรดของคุณด้วยวิธีนี้ทำให้สะดวกในการตรวจสอบบัญชีทั้งหมดของคุณ
          </v-expansion-panel-content>
        </v-expansion-panel>
        <!-- vers2 -->
        <v-expansion-panel>
          <v-expansion-panel-header>
            ZFX ถูกดูแล ควบคุมโดยที่ไหน?
          </v-expansion-panel-header>
          <v-expansion-panel-content>
            “ZFX
            เป็นแบรนด์การเทรดออนไลน์ที่ดำเนินการบริษัทที่ได้รับการควบคุมหลายแห่งเพื่อให้สามารถบริการเทรด
            Forex และ CFD ที่ได้รับการควบคุมในระดับสากล เมื่อคุณเปิดบัญชีเทรดกับ
            ZFX คุณจะกลายเป็นลูกค้าของ Zeal Capital Market (UK) Limited หรือ
            Zeal Capital Market (Seychelles) Limited;
            ทั้งสองบริษัทได้รับอนุญาตและได้รับอนุญาต Zeal Capital Market (UK)
            Limited ได้รับอนุญาตและควบคุมโดย Financial Conduct Authority
            พร้อมหมายเลขอ้างอิง: 768451
            คุณสามารถค้นหาข้อมูลเกี่ยวกับการอนุญาตได้ที่ FCA’s Financial
            Services Register : https://register.fca.org.uk/s
            /firm?id=001b000003d2shHAAQ Zeal Capital Market (Seychelles) Limited
            ได้รับการควบคุมในฐานะตัวแทนจำหน่ายหลักทรัพย์โดย Financial Services
            Authority of Seychelles ด้วยหมายเลขใบอนุญาต: SD027
            คุณสามารถค้นหาบริษัทที่มีรายชื่ออยู่ในรายชื่อหน่วยงานกำกับดูแลของหน่วยงานกำกับดูแล:
            https://fsaseychelles.sc/regulated-entities/capital-markets”
          </v-expansion-panel-content>
        </v-expansion-panel>

        <!-- vers2 -->
        <v-expansion-panel>
          <v-expansion-panel-header>
            ฉันได้รับการคุ้มครองโดยกองทุนชดเชยผู้ลงทุนหรือไม่?
          </v-expansion-panel-header>
          <v-expansion-panel-content>
            “หากคุณเป็นลูกค้าของ Zeal Capital Market (UK) Limited
            ซึ่งเป็นบริษัทที่ได้รับอนุญาตและควบคุมโดย Financial Conduct
            Authority ในสหราชอาณาจักร
            จากนั้นคุณจะได้รับการคุ้มครองโดยโครงการค่าตอบแทนทางการเงิน (FSCS)
            หาก Zeal Capital Market (UK) Limited ล้มละลาย
            ลูกค้าแต่ละรายจะได้รับการคุ้มครองโดยอัตโนมัติและสามารถรับเงินที่ลงทุนไปได้ถึง
            85,000 ปอนด์”
          </v-expansion-panel-content>
        </v-expansion-panel>

        <!-- vers2 -->
        <v-expansion-panel>
          <v-expansion-panel-header>
            คุณจะส่งมอบสินทรัพย์ที่ฉันเทรด จริงหรือไม่??
          </v-expansion-panel-header>
          <v-expansion-panel-content>
            “พูดง่ายๆว่า “ไม่” เราจะไม่ส่งมอบสินทรัพย์ใดๆ
            ที่คุณเทรดในบัญชีของคุณ ZFX เป็นโบรกเกอร์แบบสัญญาซื้อขายส่วนต่าง
            (CFD) CFD เป็นอนุพันธ์ประเภทหนึ่งที่ชำระเป็นเงินสดเสมอ ไม่ควรสับสน
            CFDs กับอนุพันธ์ประเภทอื่น เช่น
            ฟิวเจอร์สหรือออปชั่นที่มีตัวเลือกการจัดส่งจริง ตัวอย่างเช่น
            เมื่อทำการเทรด CFDs หากคุณซื้อทองคำหนึ่งออนซ์
            แสดงว่าคุณไม่ได้ซื้อทองคำจริงๆ คุณกำลังเปิดสถานะ
            ซึ่งจะต้องปิดในบางจุดในอนาคต CFDs ไม่มีวันหมดอายุ
            หมายความว่าคุณเลือกได้ว่าจะปิดสถานะเมื่อใด
            เว้นแต่จะสภาพคล่องของบัญชีไม่เพียงพอ สำหรับ
            กรณีเมื่อคุณปิดสถานะของคุณ
            เราจะชำระส่วนต่างระหว่างราคาเปิดและราคาปิดในบัญชีเทรดของคุณ
            หากคุณทำกำไรได้ เราจะเพิ่มยอดเงินในบัญชีของคุณ
            ในขณะที่หากคุณไม่ได้กำไร เราจะได้รับยอดคงเหลือจากบัญชีของคุณ
            เราไม่สามารถส่งมอบผลิตภัณฑ์ต้นแบบได้ ไม่ว่าในกรณีใดก็ตาม
            หลักการเดียวกันนี้มีผลบังคับใช้หากคุณเทรดผลิตภัณฑ์อื่นๆ เช่น หุ้น
            น้ำมัน หรือสกุลเงิน”
          </v-expansion-panel-content>
        </v-expansion-panel>
        <!-- vers2 -->
        <v-expansion-panel>
          <v-expansion-panel-header>
            ฉันสามารถเทรดเมื่อไหร่?
          </v-expansion-panel-header>
          <v-expansion-panel-content>
            “ตลาด Forex เป็นที่รู้จักกันดีในการดำเนินงาน 24 ชั่วโมงต่อวัน
            ห้าวันต่อสัปดาห์ แต่ที่ ZFX เรามีสินทรัพย์หลายประเภท
            แต่ละประเภทมีช่วงการเทรดที่แตกต่างกันและแตกต่างกันไปตามเขตเวลา
            หากต้องการทราบว่าผลิตภัณฑ์พร้อมสำหรับการเทรดเมื่อใด
            คุณสามารถดูข้อกำหนดของสัญญาได้จากเว็บไซต์ ZFX
            หรือตรวจสอบจากภายในแพลตฟอร์มการเทรด ผลิตภัณฑ์ Forex ตลาด Forex
            เปิดในวันจันทร์ เวลา 08:00 น. ในซิดนีย์ (22:00 GMT) และปิดในวันศุกร์
            เวลา 17:00 น. ในนิวยอร์ก (21:00 GMT) บนแพลตฟอร์ม ZFX MT4
            เราเริ่มเซสชั่นการเทรด เวลา 22:05 GMT และสิ้นสุดในเวลา 20:55 GMT
            ทำให้มีช่องว่างระหว่างวันเทรด 10 นาที สินค้าโภคภัณฑ์
            สินค้าโภคภัณฑ์ส่วนใหญ่ โดยเฉพาะอย่างยิ่งสินค้าที่มีสภาพคล่องสูง
            มักจะมีการเทรดเกือบ 24 ชั่วโมงต่อวัน
            โดยมักจะมีการพักหนึ่งชั่วโมงระหว่างวันเทรด ผลิตภัณฑ์ดัชนี
            เราเสนอดัชนีจากทั่วโลก และช่วงการเทรดก็แตกต่างกันอย่างมาก
            ดัชนีที่มีสภาพคล่องสูงบางตัวสามารถเทรดได้เกือบ 24 ชั่วโมงต่อวัน
            ดัชนีบางตัวมีช่วงพักยาว
            และบางตัวสามารถเทรดได้เพียงไม่กี่ชั่วโมงในแต่ละวัน หุ้น
            เราให้บริการเทรดหุ้นจากบริษัทจดทะเบียนในสหรัฐฯ
            เวลาที่ผลิตภัณฑ์เหล่านี้มีจำหน่ายจะขึ้นอยู่กับเวลาที่การแลกเปลี่ยนหุ้นพื้นฐานกำลังดำเนินการอยู่
            NYSE และ NASDAQ เปิดทำการระหว่างเวลา 09:30 น. ถึง 16:00 น.
            ตามเวลานิวยอร์กในวันจันทร์ถึงวันศุกร์
            ยกเว้นวันหยุดธนาคารของสหรัฐอเมริกา
          </v-expansion-panel-content>
        </v-expansion-panel>
        <!-- vers2 -->
        <v-expansion-panel>
          <v-expansion-panel-header>
            จะรักษาความปลอดภัยบัญชีของฉันได้อย่างไร?
          </v-expansion-panel-header>
          <v-expansion-panel-content>
            การรักษาความปลอดภัยทางไซเบอร์เป็นภัยคุกคามอย่างแท้จริง
            และทุกคนที่ใช้อินเทอร์เน็ตเพื่อลงทุนออนไลน์จำเป็นต้องระมัดระวังและปฏิบัติตามแนวทางปฏิบัติที่ดีที่สุดเพื่อรักษาบัญชีออนไลน์
            ของตนให้ปลอดภัย ที่ ZFX
            เราให้ความสำคัญกับความปลอดภัยทางไซเบอร์เป็นอย่างมาก
            และคุณสามารถมั่นใจได้ว่าเรากำลังดำเนินการ
            ขั้นตอนที่จำเป็นเพื่อรักษาเงินของคุณให้ปลอดภัย อย่างไรก็ตาม
            มีบางสิ่งที่คุณสามารถทำได้เพื่อป้องกันตัวเอง
            ใช้รหัสผ่านเฉพาะสำหรับบัญชี ZFX ของคุณ
            คุณไม่ควรใช้รหัสผ่านเดียวกันมากกว่าหนึ่งครั้ง
            บางทีบริการออนไลน์อื่นที่คุณใช้อยู่นั้นอาจทำให้
            แฮกเกอร์สามารถลองใช้รหัสผ่านนั้นกับบัญชีอื่นได้ ระมัดระวัง
            เมื่อเข้าสู่ระบบบัญชี ZFX ของคุณหรือเปิดอีเมลจากเรา
            ตรวจสอบให้แน่ใจว่าคุณกำลังเยี่ยมชม zfxuk.com
            และตรวจสอบว่าอีเมลที่คุณเปิดมาจากที่อยู่อีเมลอย่างเป็นทางการ
            รักษาบัญชีโทรศัพท์และอีเมลของคุณให้ปลอดภัย
            เราใช้ที่อยู่อีเมลและหมายเลขโทรศัพท์มือถือของคุณเพื่อตรวจสอบการดำเนินการบางอย่างในบัญชีของคุณ
            หากมีการบุกรุก
            จะเพิ่มโอกาสที่ผู้อื่นจะเข้าถึงบัญชีของคุณโดยไม่ได้รับอนุญาต
            หากคุณทำโทรศัพท์หาย
            โปรดแจ้งให้เราทราบทันทีและเปลี่ยนรหัสผ่านทั้งหมดของคุณ
            รวมถึงรหัสผ่านสำหรับ MyZFX
            หากคุณสังเกตเห็นสิ่งน่าสงสัยเกี่ยวกับบัญชีของคุณหรือการสื่อสารที่คุณได้รับ
            โปรดแจ้งให้เราทราบทันทีทาง cs@zfx.com
          </v-expansion-panel-content>
        </v-expansion-panel>
        <!-- vers2 -->
        <v-expansion-panel>
          <v-expansion-panel-header>
            จะลงชื่อเข้าใช้จากอุปกรณ์ใหม่ได้อย่างไร?
          </v-expansion-panel-header>
          <v-expansion-panel-content>
            การเทรดและการลงทุนออนไลน์คือคุณสามารถเข้าถึงตำแหน่งและการลงทุนของคุณได้ทุกที่ด้วยการเชื่อมต่ออินเทอร์เน็ต
            หากคุณกำลังเทรดกับ ZFX คุณสามารถเข้าถึงโปรไฟล์ MyZFX เข้าถึง MyZFX
            จากอุปกรณ์ใหม่ MyZFX
            เป็นเว็บแอปพลิเคชันที่ปรับให้เหมาะกับอุปกรณ์มือถือ
            ดังนั้นคุณจึงสามารถสลับระหว่างคอมพิวเตอร์และอุปกรณ์มือถือของคุณได้อย่างราบรื่นเพื่อเข้าถึงบัญชี
            MyZFX ของคุณ หากต้องการเข้าถึง MyZFX จากทุกที่ เพียงไปที่
            https://my.zfxuk.com/
            และลงชื่อเข้าใช้โดยใช้หมายเลขโทรศัพท์มือถือหรือที่อยู่อีเมลและรหัสผ่านของคุณ
          </v-expansion-panel-content>
        </v-expansion-panel>
        <!-- vers2 -->
        <v-expansion-panel>
          <v-expansion-panel-header>
            ฉันจะเรียนรู้วิธีการเทรดได้อย่างไร?
          </v-expansion-panel-header>
          <v-expansion-panel-content>
            หากคุณเพิ่งเริ่มเทรด คุณมาถูกที่แล้ว ZFX Academy
            ได้รับการพัฒนาขึ้นเพื่อช่วยเหลือนักเทรดทุกคน
            ไม่ว่าคุณจะมีประสบการณ์ในระดับใด
            เราได้ใช้ความระมัดระวังเป็นพิเศษเพื่อให้แน่ใจว่า
            มือใหม่จะมีข้อมูลที่เชื่อถือได้และเป็นประโยชน์ที่พวกเขาสามารถพึ่งพาได้โดยไม่ต้องเสียเงินสักบาทเดียว
            เรียกดู ZFX Academy ผ่านเว็บ บทความ และแนวโน้มตลาดที่เป็นประโยชน์
            ซึ่งหากคุณยังใหม่ต่อการเทรด ขอแนะนำอย่างยิ่งให้ฝึกฝนในบัญชีทดลอง
            แทนที่จะเสี่ยงที่จะสูญเสียเงิน
            บัญชีเทรดทดลองได้รับการออกแบบมาเพื่อเลียนแบบบัญชีจริงสำหรับเทรดเดอร์โดยเฉพาะ
          </v-expansion-panel-content>
        </v-expansion-panel>
        <!-- vers2 -->
        <v-expansion-panel>
          <v-expansion-panel-header>
            วิธีการลงทุนในตลาดสหรัฐ?
          </v-expansion-panel-header>
          <v-expansion-panel-content>
            สหรัฐอเมริกาเป็นที่ตั้งของบริษัทที่ใหญ่ที่สุดในโลกหลายแห่งและตลาดหลักทรัพย์ที่ใหญ่ที่สุดสองแห่งคือ
            New York Stock Exchange และ NASDAQ
            นักเทรดจำนวนมากมีความสนใจในการเทรดหรือลงทุนในบริษัทจดทะเบียนในสหรัฐฯ
            ด้วยบัญชีเทรด ZFX คุณ
            สามารถเทรดหุ้นในบริษัทในสหรัฐอเมริกาได้โดยใช้สัญญาซื้อขายส่วนต่าง
            (CFDs) ด้วยเลเวอเรจบนแพลตฟอร์ม MetaTrader 4 ZFX ไม่ใช่ Broker
            ซื้อขายหุ้น ดังนั้นเราจึงไม่ซื้อหรือขายหุ้น เราเป็น Broker CFDs
            ดังนั้นเราจึงเป็นคนกลางในการให้นักเทรดสามารถเทรด CFDs
            โดยออเดอร์หรือสถานะเทรดจะ เข้าสู่ตลาดเมื่อคุณเทรด
            ซึ่งสถานะหรือออเดอร์จะถูกชำระเป็นเงินสด CFDs
            ดีกว่าสำหรับการเก็ง(Short)กำไรระยะสั้นและกลยุทธ์การเทรดรายวัน
            ในขณะที่การเทรด
            (Long)จะเหมาะสมกว่าหากคุณวางแผนที่จะเป็นถือสถานะหรือออเดอร์
            เป็นเวลาหลายเดือน หรือปี
          </v-expansion-panel-content>
        </v-expansion-panel>
        <!-- vers2 -->
        <v-expansion-panel>
          <v-expansion-panel-header>
            ฉันจะติดต่อฝ่ายสนับสนุนลูกค้าได้อย่างไร??
          </v-expansion-panel-header>
          <v-expansion-panel-content>
            หากคุณต้องการความช่วยเหลือหรือมีคำถามที่ต้องการคำตอบ
            คุณสามารถติดต่อเจ้าหน้าที่ฝ่ายสนับสนุนของ ZFX ด้วยวิธีต่อไปนี้:
            อีเมล์ : cs@zfxuk.com Live chat
          </v-expansion-panel-content>
        </v-expansion-panel>
      </v-expansion-panels>
    </div>
  </div>
</template>
<script>
import { mapActions } from "vuex";

export default {
  data() {
    return {
      selectedItem: 0,
    };
  },
  methods: {
    ...mapActions("authen", ["logout"]),
    changeLang(lang) {
      this.$i18n.locale = lang;
      this.$cookies.set("lang", lang);
    },
    onLogout() {
      this.logout();
      this.$router.push("/");
    },
  },
};
</script>
