<template>
  <div>
    <WidgetsNavbar
      leftIcon="mdi-chevron-left"
      RouteTo="/Wallet"
      :title="$t('LeveragePolicy')"
    />
    <div class="warper" style="background-color: #ffffff">
      <div
        class="header"
        style="display: flex; justify-content: center; margin-top: 60px"
      >
        <h3>นโยบายเลเวอเรจ</h3>
        <br />
      </div>
      <div class="risk-buyandsell" style="padding: 20px">
        <h4>เลเวอเรจอ้างอิงจาก Equity ในบัญชีซื้อขาย</h4>
        <p style="margin-top: 10px">
          เมื่อท่านซื้อขายผลิตภัณฑ์ FX และ ทองคำ ในบัญชี ZFX Cent
          ท่านสามารถใช้เลเวอเรจสูงสุดถึง 1:2000
          ขึ้นอยู่กับจำนวนเงินในบัญชีซื้อขายของท่าน
          เพื่อจุดประสงค์ในการบริหารความเสี่ยง
          ระบบของเราจะดำเนินการปรับลดเลเวอเรจสูงสุดของท่านเมื่อ Equity
          ในบัญชีถึงระดับที่กำหนด
          การซื้อขายที่มีอยู่ของคุณจะได้รับผลกระทบนี้เช่นกัน
          โปรดตรวจสอบข้อมูลเพิ่มเติมของระดับเลเวเรจด้านล่างนี้
        </p>
      </div>
      <div class="risk-CFD" style="padding: 20px">
        <h4>การเปลี่ยนแปลงเลเวอเรจในช่วงสุดสัปดาห์และวันหยุด</h4>

        <p style="margin-top: 10px">
          ระบบบริหารความเสี่ยงของเราเพื่อลดผลกระทบที่ไม่จำเป็นใดๆ
          ที่อาจเกิดขึ้นจากความผันผวนของตลาดต่อบัญชีซื้อขายของลูกค้า
          เนื่องจากสถานะการณ์ทางเศรษฐกิจและการตลาดที่สำคัญ
          ระบบอาจปรับลดเลเวอเรจสูงสุดลงที่ 1:400 ในบัญชี ZFX Cent ของการซื้อขาย
          FX และโลหะมีค่า โดยปกติคือ 30
          นาทีก่อนการประกาศข่าวสำคัญและกลับสู่สภาวะปกติที่เลเวอเรจเดิม ใน 10
          นาที หลังจากจบการประกาศข่าวสำคัญ
          ผลบังคับใช้นี้จะส่งผลการซื้อขายที่เปิดอยู่ คำสั่งที่รอดำเนินการซื้อขาย
          (Pending Order) และการซื้อขายใหม่ทั้งหมด
          โปรดทราบว่าการเปลี่ยนแปลงอัตราเลเวอเรจจะส่งผลกระทบต่อมาร์จิ้นที่ต้องใช้ของบัญชีซื้อขายของท่าน
          และท่านมีหน้าที่ในการตรวจสอบเงินทุนให้เพียงพอเพื่อที่จะรองรับการเทรดของท่าน
          ZFX
          จะดำเนินการปรับนโยบายเลเวอเรจเพื่อตอบสนองต่อสถานกาณ์ตลาดที่แตกต่างกัน
          โปรดระมัดระวังและตรวจสอบประกาศจากทางบริษัทอย่างสม่ำเสมอ
        </p>
      </div>
      <div class="risk-CFD" style="padding: 20px">
        <h4>การเปลี่ยนแปลงเลเวอเรจในช่วงเหตุการณ์ทางเศรษฐกิจและตลาดการเงิน</h4>

        <p style="margin-top: 10px">
          ระบบการบริหารความเสี่ยงของเราเพื่อลดผลกระทบที่ไม่จำเป็นใดๆที่อาจเกิดจากความผันผวนของตลาดต่อบัญชีซื้อขายของลูกค้า
          เนื่องด้วยเหตุการณ์ทางเศรษฐกิจและตลาดที่สำคัญ
          ระบบอาจปรับลดเลเวอเรจสูงสุดลงมาที่ 1:400 ในบัญชี ZFX Cent
          ของการซื้อขาย FX และโลหะมีค่า โดยปกติคือ 30 นาที
          ก่อนการประกาศข่าวสำคัญและกลับคืนสู่ระดับเลเวอเรจเดิม
          หลังจากมีการประกาศข่าวประมาณ 10 นาที
          ผลบังคับใช้นี้จะส่งผลการซื้อขายที่เปิดอยู่ คำสั่งที่รอดำเนินการซื้อขาย
          (Pending Order) และการซื้อขายใหม่ทั้งหมด
        </p>

        <p style="margin-top: 20px; color: cornflowerblue">
          โปรดทราบว่าการเปลี่ยนแปลงอัตราเลเวอเรจจะส่งผลกระทบต่อมาร์จิ้นที่ต้องใช้ของบัญชีซื้อขายของท่าน
          และท่านมีหน้าที่ในการตรวจสอบเงินทุนให้เพียงพอเพื่อที่จะรองรับการเทรดของท่าน
          ZFX
          จะดำเนินการปรับนโยบายเลเวอเรจเพื่อตอบสนองต่อสถานกาณ์ตลาดที่แตกต่างกัน
          โปรดระมัดระวังและตรวจสอบประกาศจากทางบริษัทอย่างสม่ำเสมอ
          ZFXจะดำเนินการปรับนโยบายเลเวอเรจเพื่อตอบสนองต่อสถานกาณ์ตลาดที่แตกต่างกัน
          โปรดระมัดระวังและตรวจสอบประกาศจากทางบริษัทอย่างสม่ำเสมอ
        </p>
        <p style="margin-top: 20px">
          หมายเหตุ : หากเอกสารฉบับนี้มีการตีความเป็นภาษาอื่น
          หรือเกิดข้อพิพาทในการตีความหมาย
          ให้อิงฉบับภาษาอังกฤษมาใช้ในการตีความและตัดสินเป็นหลัก
        </p>
      </div>
    </div>
  </div>
</template>
<script>
import { mapActions } from "vuex";

export default {
  data() {
    return {
      selectedItem: 0,
    };
  },
  methods: {
    ...mapActions("authen", ["logout"]),
  },
};
</script>
