<template>
  <div>
    <WidgetsNavbar
      leftIcon="mdi-chevron-left"
      RouteTo="/Wallet"
      :title="$t('term')"
    />
    <div class="warper" style="background-color: #ffffff">
      <div
        class="header"
        style="display: flex; justify-content: center; margin-top: 60px"
      >
        <h4>ข้อกำหนดและเงื่อนไขในการใช้เว็บไซต์</h4>
      </div>
      <div class="risk-buyandsell" style="padding: 20px">
        <p>เครื่องหมายการค้าและสิทธิในทรัพย์สินทางปัญญา</p>
        <p style="margin-top: 10px">
          กลุ่มบริษัท Zeal (จากนี้จะอ้างถึงโดยเรียกว่า บริษัท)
          ทำการซื้อ-ขายในนามของ ZFX และ Zeal
          เป็นเจ้าของลิขสิทธิ์ในเว็บไซต์นี้และในหน้าจอที่กำลังแสดงบนเว็บไซต์นี้
          และเป็นเจ้าของลิขสิทธิ์ข้อมูล,
          เนื้อหาในเว็บไซต์และการเรียบเรียงทั้งหมดเว้นแต่จะระบุไว้เป็นอย่างอื่น
          บริษัทมีเอกสิทธิ์,
          ใบอนุญาตหรือใบอนุญาตอื่นเพื่อใช้ชื่อทางการค้าและเครื่องหมายการค้าทั้งหมดที่อยู่ในและ/หรือปรากฏในเว็บไซต์นี้
        </p>
      </div>
      <div class="risk-CFD" style="padding: 20px">
        <p>การเปลี่ยนข้อมูลและเนื้อหา</p>
        <p style="margin-top: 10px">
          ข้อมูลและเนื้อหาในเว็บไซต์, ข้อกำหนดและเงื่อนไข,
          ข้อกำหนดเบื้องต้นและคำอธิบายในเว็บไซต์นี้อาจเปลี่ยนแปลงโดยไม่ได้แจ้งล่วงหน้า
        </p>
      </div>
      <div class="risk-CFD" style="padding: 20px">
        <p>การจำกัดความรับผิด</p>
        <p style="margin-top: 10px">
          บริษัทไม่รับประกันความถูกต้อง
          ความครบถ้วนหรือสมบูรณ์ของข้อมูลและเนื้อหาในเว็บไซต์
          บริษัทไม่รับผิดต่อความผิดพลาดและ/หรือเนื้อหาส่วนที่ขาดไปในเว็บไซต์นี้
          บริษัทไม่รับประกันไม่ว่าโดยนัยยะ
          โดยชัดแจ้งหรือไม่รับประกันตามกฎหมายว่าข้อมูลและเนื้อหาในเว็บไซต์จะไม่ละเมิดสิทธิของบุคคลที่สาม
          กรรมสิทธิ์
          มีความเหมาะสมในการใช้งานเชิงพาณิชย์หรือเหมาะสมสำหรับวัตถุประสงค์เฉพาะหรือปลอดจากไวรัสคอมพิวเตอร์ไฮเปอร์ลิงก์ที่เชื่อมต่อไปยังเว็บไซต์อื่นในอินเตอร์เน็ตอาจมีความเสี่ยง
          บริษัทไม่ได้ควบคุม สืบสวน ยืนยันความถูกต้อง
          ติดตามและ/หรือให้การรับรองเนื้อหา ความถูกต้อง
          ความเห็นและลิงก์ในเว็บไซต์เหล่านี้บริษัทไม่มีความรับผิดต่อ
        </p>

        <li style="margin-top: 20px">
          ความเสียหาย, ความสูญเสียหรือค่าใช้จ่ายที่เกิดจากเว็บไซต์,
          การใช้เว็บไซต์, การไม่สามารถใช้เว็บไซต์,
          การไม่สามารถดำเนินงานตามคำสั่ง, ความผิดพลาด, การละเว้นไม่ปฏิบัติ,
          การขัดข้อง, ความผิดพลาด, ความล่าช้าในการทำงานหรือการส่งข้อมูล,
          ไวรัสคอมพิวเตอร์, ความไม่สามารถสื่อสาร, การเชื่อมต่อและระบบไม่ทำงาน
          แม้ว่าบริษัทหรือตัวแทนรับทราบว่าอาจเกิดความเสียหาย,
          ความสูญเสียหรือค่าใช้จ่ายนั้น
        </li>

        <li>
          ความผิดพลาดหรือความไม่ถูกต้องในการส่งข้อมูล, คำสั่งซื้อ-ขาย
          สัญญาซื้อขายส่วนต่าง (CFD)
          หรือคำสั่งอื่นๆจากลูกค้าหรือผู้เข้าใช้เว็บไซต์, การรบกวน, การปลอมแปลง,
          การถอดรหัสเข้าใช้, การบันทึกหรือส่งข้อมูลที่ผิดพลาด,
          หรือการที่ระบบหยุดทำงานเนื่องจากเหตุสุดวิสัยหรือเหตุผลอื่นที่ไม่ได้เกิดจากการที่บริษัทละเมิดข้อใดข้อหนึ่งข้างต้น
        </li>
        <p style="margin-top: 20px">
          บริษัทจะไม่รับผิดต่อความเสียหายที่เกิดกับฮาร์ดแวร์หรือซอฟต์แวร์ของผู้ใช้งานซึ่งเกิดจากการใช้เว็บไซต์นี้และ/หรือ
          การใช้เครือข่ายหรือการเชื่อมต่อกับเว็บไซต์ที่มีลิงก์ไปยังไฮเปอร์เท็กซ์/เว็บไซต์หรือเว็บเพจอื่น
        </p>
        <p>การจำกัดความรับผิด</p>
        <p style="margin-top: 20px">
          เว็บไซต์นี้ไม่ได้มีเป้าหมายเพื่อบุคคลหรือหน่วยงานในเขตอำนาจศาลหรือในประเทศใดเป็นการเฉพาะ
          และไม่ได้มีเป้าหมายให้เนื้อหาหรือการใช้เว็บไซต์ขัดแย้งกับกฎหมายหรือระเบียบในประเทศนั้น
        </p>
        <p>
          หมายเหตุ : หากเอกสารฉบับนี้มีการตีความเป็นภาษาอื่น
          หรือเกิดข้อพิพาทในการตีความหมาย
          ให้อิงฉบับภาษาอังกฤษมาใช้ในการตีความและตัดสินเป็นหลัก
        </p>
      </div>
    </div>
  </div>
</template>
<script>
import { mapActions } from "vuex";

export default {
  data() {
    return {
      selectedItem: 0,
    };
  },
  methods: {
    ...mapActions("authen", ["logout"]),
    changeLang(lang) {
      this.$i18n.locale = lang;
      this.$cookies.set("lang", lang);
    },
    onLogout() {
      this.logout();
      this.$router.push("/");
    },
  },
};
</script>
